/*Пришло время скомпилировать вашу первую программу. По традиции первой программой является
"Hello, world!". В данном степе мы предлагаем вам взять программу из шаблона, сохранить её в текстовом
файле с расширением .cpp, скомпилировать её самостоятельно и запустить. Это позволит вам проверить, что
ваш компилятор установлен и работает.
Выполнил: Саполетова Анастасия
Источник: Stepik Computer Science Center (CS центр)
Программирование на языке C++
1.6.7 https://stepik.org/lesson/535/step/7
23.04.2020
*/
#include <iostream>

int main()
{
    std::cout << "Hello, World!\n";
    return 0;
}
