Конструктор, который не имеет параметров (или имеет параметры, все из которых имеют значения по умолчанию), 
называется конструктором по умолчанию. Он вызывается, если пользователем не указаны значения для инициализации.

МДК.01.02 "Прикладное программирование"
ЛЗ 9. Разработка программ со строками
Составитель: Гусятинер Л.Б., 25.04.2020, МГОТУ ККМТ, П1-17, П2-17

[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?

	Конструктор, который не имеет параметров (или имеет параметры, все из которых имеют значения по умолчанию), 
	называется конструктором по умолчанию. Он вызывается, если пользователем не указаны значения для инициализации.

2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.

	1) string s;
	2) string s = "String";
	3) string s("String");

3) Упражнение 3.4. Каковы значения переменных s и s2?
string s; 
int main() { 
	string s2;
}

	s = "" (глобальная, доступна везде)
	s2 = "" (локальная, доступна только в main)

[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.

	Целые строки(3.5_1.cpp):
		
		#include <iostream>
		using namespace std;
		int main() {
    			string s;
    			getline(cin, s);
		    	cout << s;
		    	return 0;
		}

	По словам(3.5_2.cpp):

		#include <iostream>
		using namespace std;
		int main() {
		    string word;
		    while (cin >> word)
		        cout << word << endl;
		    return 0;
		}

5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().

	Считывает из потока в переменную, до символа переноса строки

[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.

	Равны ли строки(3.7_1.cpp):

		#include <iostream>
		using namespace std;
		int main() {
		    string s1;
		    string s2;
		    getline(cin, s1);
		    getline(cin, s2);
		    cout << ((s1 == s2) ? "true" : ((s1 > s2) ? s1 : s2));
		    return 0;
		}

	Равны ли строки по длине(3.7_2.cpp):

		#include <iostream>
		using namespace std;
		int main() {
		    string s1;
		    string s2;
		    getline(cin, s1);
		    getline(cin, s2);
		    cout << ((s1.length() == s2.length()) ? "true" : ((s1.length() > s2.length()) ? s1 : s2));
 		    return 0;
		}


7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода 
и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы 
отделить соседние введенные строки пробелами.

	Соединять их в одну большую строку(3.8_1.cpp):

		#include <iostream>
		using namespace std;
		int main() {
		    string s1;
		    string s2 = "";
		    while (getline(cin, s1)) {
		        s2 = s2 + s1;
		        cout << s2 << endl;
		    }
		    return 0;
		}

	Соединять их в одну большую строку с пробелами(3.8_2.cpp):

		#include <iostream>
		using namespace std;
		int main() {
		    string s1;
		    string s2 = "";
		    while (getline(cin, s1)) {
		        s2 = s2 + s1 + ' ';
		        cout << s2 << endl;
		    }
		    return 0;
		}


8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;

	Допустимо, выведет пустой символ.

9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.
	
	3.10.cpp:

		#include <iostream>
		using namespace std;
		int main() {
		    string s1;
		    getline(cin, s1);
		    for (int i = 0; i < s1.length(); i++)
		        if (s1[i] == '.' || s1[i] == ',' || s1[i] == ';' || s1[i] == ':') {
		            s1.erase(i, 1);
		        }
		    cout << s1;
		    return 0;
		}

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt

	3.10_1.cpp:

		#include <fstream>
		#include <iostream>
		using namespace std;
		int main() {
		    string s1;
		    ifstream inf("input.txt");
		    getline(inf, s1);
		    for (int i = 0; i < s1.length(); i++)
		        if (s1[i] == '.' || s1[i] == ',' || s1[i] == ';' || s1[i] == ':') {
		            s1.erase(i, 1);
		        }
		    ofstream outf("output.txt");
		    outf << s1;
		    return 0;
		}

Ожидаемый результат.
Файлы с решениями задачи на githab в ветке репозитория группы

Критерии оценки
Каждое упражнение - по 0,5 балла

Материалы: 
1. Липпман, Стенли Б., Лажойе, Жози, Му, Барбара Э.
Язык программирования C++. Вводный курс, 4-е издание.: Пер.с англ. - М.: ООО "И.Д.Вильямс", 2007
	Глава 3. Библиотечные типы данных.
		3.1. Пространства имён и объявления using
		3.2. Библиотечный тип string

2. Александр Смаль, Михаил Кринкин
Программирование на языке C++(материалы предыдущей лекции)
https://stepik.org/course/7