// """
// В этом простом упражнении вам нужно окружить объявление функции foo стражами включения. В качестве имени 
// стража используйте FOO_HPP и не используйте pragma once.

// Требования к реализации: требуется добавить только стражи включения, ничего другого писать не нужно.
// """
//Выполнил: Пищулин Игорь
//Источник: Stepik Computer Science Center (CS центр)
//Программирование на языке C++
//1.8.4 https://stepik.org/lesson/13377/step/4
//25.04.2020
#ifndef FOO_HPP
#define FOO_HPP

void foo();
#endif

