//Пришло время скомпилировать вашу первую программу.
//По традиции первой программой является "Hello, world!". 
//В данном степе мы предлагаем вам взять программу из шаблона, сохранить её в текстовом файле с расширением .cpp,
//скомпилировать её самостоятельно и запустить. Это позволит вам проверить, что ваш компилятор установлен и работает.
//Курс Программирование на языке C++ (Степик. Александ Смаль, Михаил Кринкин) 
// Выполнила: Суркова Валерия П1-17.
//Дата: 22 апреля 2020 г.

#include <iostream>

int main()
{
    std::cout << "Hello, World!\n";
    return 0;
}
