ЛЗ 9. Разработка программ со строками
Составитель: Гусятинер Л.Б., 25.04.2020, МГОТУ ККМТ, П1-17, П2-17

[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?
Стандартны конструктор -  конструктор, который может быть вызван без аргументов. 

2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.
    1) string s;
    2) string s = "String";
    3) string s("String");

3) Упражнение 3.4. Каковы значения переменных s и s2?
string s; 
int main() { 
	string s2;
}


[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.

Файл 3_5_1.cpp:

#include <iostream>

using namespace std;


int main() {
    string str;

    getline(cin, str);

    cout << str;

    return 0;
}

Файл 3_5_2.cpp:

#include <iostream>

using namespace std;

int main() {
    string w;

    while (cin >> w)
        cout << w << endl;

    return 0;
}

5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().

Ответ: Считывает данные из потока в строку

[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.
 
Файл 3_7_1.cpp:

#include <iostream>

using namespace std;

int main() {
    string str1;
    string str2;

    getline(cin, str1);
    getline(cin, str2);

    cout << ((str1 == str2) ? "Строки равны" : ((str1 > str2) ? str1 : str2));

    return 0;
}

Файл 3_7_2.cpp:
#include <iostream>

using namespace std;

int main() {
    string str1;
    string str2;

    getline(cin, str1);
    getline(cin, str2);

    cout << ((str1.size() == str2.size()) ? "Строки равны" : ((str1.size() > str2.size()) ? str1 : str2));

    return 0;
}


7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода 
и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы 
отделить соседние введенные строки пробелами.

Файл 3_8_1.cpp:

#include <iostream>

using namespace std;

int main() {
    string str1;
    string str2 = "";

    while (getline(cin, str1)) {
        str2 = str2 + str1;
        cout << str2 << endl;
    }

    return 0;
}

Файл 3_8_2.cpp:

#include <iostream>

using namespace std;

int main() {
    string str1;
    string str2 = "";

    while (getline(cin, str1)) {
        str2 = str2 + str1 + ' ';
        cout << str2 << endl;
    }

    return 0;
}

8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;
Данная программа выведет нулевой символ строки. 


9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.
Файл 3_10.cpp:
#include <iostream>

using namespace std;

int main() {
    string str;

    getline(cin, str);

    for (int i = 0; i < str.size(); i++)
        if (str[i] == '.' || str[i] == ',' || str[i] == ';' || str[i] == ':' || str[i] == '!' || str[i] == '?') {
            str.erase(i, 1);
        }
    cout << str;

    return 0;
}

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt

Файл 10_3_10.cpp:

#include <iostream>
#include <fstream>
#include <iostream>

using namespace std;

int main() {
    string str;
    ifstream fInput("input.txt");
    getline(fInput, str);

    for (int i = 0; i < str.size(); i++)
        if (str[i] == '.' || str[i] == ',' || str[i] == ';' || str[i] == ':' || str[i] == '!' || str[i] == '?') {
            str.erase(i, 1);
        }
    ofstream fOutput("output.txt");
    fOutput << str;

    return 0;
}
