/******************************************************************************
Array 32. Дан массив размера N. Найти номер его первого локального минимума 
(локальный минимум — это элемент, который меньше любого из своих соседей).
*******************************************************************************/
#include <stdio.h>
 
int main()
{
    int a[10];
    int n;
 
    scanf("%d",&n);
 
    int i;
    for (i = 0; i < n; ++i){
        printf("",i+1);
        scanf("%d",&a[i]);
    }
 
 
    if (a[0] < a[1]){
        printf("%d \n",1);
    } 
    else 
    {
        i = 1;
        while ((i < n - 1) && !((a[i-1] > a[i]) &&(a[i] < a[i + 1]))) {
                ++i;
            }
        printf("%d \n",i+1);
        }
    return 0;
}