///Задание: В этом простом упражнении вам нужно окружить объявление функции foo стражами включения. 
///В качестве имени стража используйте FOO_HPP и не используйте pragma once.
///Требования к реализации: требуется добавить только стражи включения, ничего другого писать не нужно.
///Источник: Stepic Программирование на языке C++ https://stepik.org/7 от Computer Science Center(CS центр)
///Глава 1, раздел 5, шаг 12. https://stepik.org/lesson/534/step/12
///Выполнил: Юшаков Н. Р. 21.04.2020.
#ifndef 1_5_12_H_INCLUDED
#define 1_5_12_H_INCLUDED

void foo();

#endif // 1_5_12_H_INCLUDED
