///Задание: Пришло время скомпилировать вашу первую программу. По традиции первой программой является "Hello, world!". 
///В данном степе мы предлагаем вам взять программу из шаблона, сохранить её в текстовом файле с расширением .cpp, 
///скомпилировать её самостоятельно и запустить. Это позволит вам проверить, что ваш компилятор установлен и работает.
///Если у вас возникли какие-то вопросы по компиляции программы, то задавайте их в комментариях.
///Требования к реализации: ничего менять не нужно, нужно просто отправить шаблон.
///Источник: Stepic Программирование на языке C++ https://stepik.org/7 от Computer Science Center(CS центр) глава 1, раздел 6, шаг 7.
///Выполнил: Юшаков Н. Р. 22.04.2020.
#include <iostream>

int main()
{
    std::cout << "Hello, World!\n";
    return 0;
}
