/* Пришло время скомпилировать вашу первую программу. По традиции первой программой является "Hello, world!". В данном степе мы предлагаем 
вам взять программу из шаблона, сохранить её в текстовом файле с расширением .cpp, скомпилировать её самостоятельно и запустить. Это 
позволит вам проверить, что ваш компилятор установлен и работает.
Если у вас возникли какие-то вопросы по компиляции программы, то задавайте их в комментариях.
Требования к реализации: ничего менять не нужно, нужно просто отправить шаблон.
Выполнил : Звонарёв Д.А. П1-17 21 апреля 2020
Источник : stepik, программирование на языке с++ Михаил Кринкин, 1.6.7, https://stepik.org/lesson/535/step/7?unit=858
*/
#include <iostream>

int main()
{
    std::cout << "Hello, World!\n";
    return 0;
}
