Выполнила : Озерова А.С. П1-17 14 мая 2020

ЛЗ 9. Разработка программ со строками

[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?
Ответ : Стандартный конструктор(конструктор по умолчанию)-конструктор, который может быть вызван без аргументов.

2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.
Ответ : 
1 - Инициализация по умолчанию(string s1)
2 - Прямая инициализация(string s6("hiya"), string s7(10, 'c'))
3 - Инициализация копией(string s5 = "hiya")


3) Упражнение 3.4. Каковы значения переменных s и s2?
string s; 
int main() 
{ 
	string s2;
}
Ответ : s и s2 - пустые строки

[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.
Ответ : см. файл 3.5.cpp

5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных в строковую переменную, когда используется функция getline().
Ответ : Строка считывается до символа перевода строки и сохраняет прочитанное, в том числе и пробельные символы; также считываются предваряющие пробелы.

[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.
Ответ : см. файл 3.7.cpp

7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы отделить соседние введенные строки пробелами.
Ответ : см. файл 3.8.cpp

8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;
Ответ : допустимо - программа должна вывести нулевой элемент строки s; строка s - пустая, следовательно, ничего не выведется.

9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.
Ответ : см. файл 3.10.cpp

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt
Ответ : см. файлы 3.10.2.cpp input.txt output.txt
