ЛЗ 9. Разработка программ со строками
Выполнил студент группы П1-17 Саполетова Анастасия

[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?
Это конструктор без параметров

2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.
	1. string s;
	2. string s("String");
	3. string s = "String";	

3) Упражнение 3.4. Каковы значения переменных s и s2?
string s; 
int main() { 
	string s2;
}

Переменные s и s2 - пустые


[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.

Программа,читающая целые строки
#include <iostream>

using namespace std;

string s2;

int main() {
    string str;

    getline(cin, str); 

    cout << str;

    return 0;
}

Программа, читающая отдельные слова
#include <iostream>

using namespace std;

string s2;

int main() {
    string word;

    while (cin >> word) 
        cout << word << endl;

    return 0;
}


5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().

Считывает данные из потока в строку


[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше.
#include <iostream>

using namespace std;

string s2;

int main() {
    string s1;
    string s2;

    getline(cin, s1);
    getline(cin, s2);

    cout << ((s1 == s2) ? "true" : ((s1 > s2) ? s1 : s2));

    return 0;
}


Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.
#include <iostream>

using namespace std;

string s2;

int main() {
    string s1;
    string s2;

    getline(cin, s1);
    getline(cin, s2);

    cout << ((s1.length() == s2.length()) ? "true" : ((s1.length() > s2.length()) ? s1 : s2));

    return 0;
}


7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода 
и соединять их в одну большую строку. Отобразите полученную строку. 

#include <iostream>

using namespace std;

int main()
{
    string s1;
    string s2 = "";

    while (getline(cin, s1))
    {
        s2 = s2 + s1;
        cout << s2 << endl;
    }

    return 0;
}

Измените программу так, чтобы отделить соседние введенные строки пробелами.

#include <iostream>

using namespace std;

int main()
{
    string s1;
    string s2 = "";

    while (getline(cin, s1))
    {
        s2 = s2 + s1 + ' ';
        cout << s2 << endl;
    }

    return 0;
}



8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;
Данная программа ошибку не выдает.Допустимо.


9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.
#include <iostream>

using namespace std;

int main()
{
    string s;

    getline(cin, s);
    for (int i = 0; i < s.length(); i++)
        if (s[i] == '.' || s[i] == ',' || s[i] == ';' || s[i] == ':')
        {
            s.erase(i, 1);
        }
    cout << s;

    return 0;
}

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt

Задача выполнена в отдельной папке






