[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?
Конструкторы - методы, используемые для инициализации структур.

2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.
1.struct point{
point()
x = y = "mama";
}
2.point (strint x, string y)
this->x=x;
this->y=y;
3.point(): x(0) y(0)

3) Упражнение 3.4. Каковы значения переменных s и s2?
string s; 
int main() { 
	string s2;
}
Это пустые строки

[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.
Целые строки:
int main(){
  string str1;
  cin >> str1;
  cout << str1;
}

Отдельные слова:
int main(){
  string str;
  while (getline(cin, str, ' '))
  {
     cout << str;
  } 
}

5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().

[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.
1. int main(){
  string str1, str2;
  cin >> str1;
  cin >> str2;
  if (str1 == str2)
    cout << "ravni";
  else if (str1 > str2)
    cout << "str1";
  else
    cout << "str2";
}

2.

7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода 
и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы 
отделить соседние введенные строки пробелами.
#include <iostream>
#include <string>
using namespace std;

int main(){
    string str1, str2;
    int s1, s2;
    cin >> str1;
    cin >> str2;
    cout << str1 + " " + str2;
}

8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;
Данная программа выводит первый(нулевой) символ строки. Данная запись не лучший выбор, хотя бы потому что строка может быть не объявленной.

9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.
int main(){
    string str1;
    cin >> str1;
    int i = 0;
    for (i = 0; i < str1.length(); i++)
    {
        if (str1[i] != '.' && str1[i] != ',' && str1[i] != ';')
            cout << str1[i];
    }
}

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt
int main(){
    ifstream fin;
    ofstream fout;
    fin.open("1.txt");
    string str1;
    /*cin >> str1;*/
    fin >> str1;
    fout.open("2.txt");
    for (int i = 0; i < str1.length(); i++)
    {
        if (str1[i] != '.' && str1[i] != ',' && str1[i] != ';')
            fout << str1[i];
    }
    fout.close();
}
