/**
Пришло время скомпилировать вашу первую программу. По традиции первой программой
является "Hello, world!". В данном степе мы предлагаем вам взять программу из шаблона,
сохранить её в текстовом файле с расширением .cpp, скомпилировать её самостоятельно и
запустить. Это позволит вам проверить, что ваш компилятор установлен и работает.
**/

#include <iostream>

int main()
{
    std::cout << "Hello, World!\n";
    return 0;
}

///Выполнила: Фролова Л.А.
///Дата выполнения: 22.04.2020
///Источник: https://stepik.org, курс "Программирование на языке C++"
