/* Структура "дата". Гусятинер Л.Б., 05.05.2020 */
#include <stdio.h>
struct Date { /* дата */
    int year; /* год */
    int month; /* месяц */
    int day; /* день */
};

int main() {
    /* наша дорожная карта */
    /* 1 */
    /* создать даты */
    /* подсчитать разность дат */
    /* входит ли дата в интервал дат */
    /* получить дату из строки */
    /* получить дату из 3х чисел */
    /* вывести дату прописью */
    /* 2 */
    /* разработать соответствующие функции */
    /* 3 */
    /* разбить программу на отдельные файлы заголовков и реализации */
    return 0;
}

