МДК.01.02 "Прикладное программирование"
ЛЗ 9. Разработка программ со строками
Составитель: Гусятинер Л.Б., 25.04.2020, МГОТУ ККМТ, П1-17, П2-17

[1] Упражнения раздела 3.2.1
.1) Упражнение 3.2. Что такое стандартный конструктор?
Конструкторы — это методы для инициализации структур. Cтандартный конструктор не имеет параметров.

.2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.
иниализация во время объявления, объявление с присваиванием, заполнение строки

.3) Упражнение 3.4. Каковы значения переменных s и s2?
string s; 
int main() { 
	string s2;
}
s, s2 - пустые переменные

[1] Упражнения раздела 3.2.2
.4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.
#include <iostream>
using namespace std;
int main() {
string w;
while (cin >> w)
cout << w << endl;
return 0;}

.5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().
getline() считывает данные из потока в строку не игнорируя предваряющие пробелы

[1] Упражнения раздела 3.2.4
.6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.
#include <string>
#include <iostream>
using namespace std;
int main () {
string s1,s2,s;
getline(cin, s1);
getline(cin, s2);
int c1 = s1.size(), c2 = s2.size();
s = (c1 == c2) ? ("равны") : (c1 > c2) ? (s1) : (s2);
cout << s;
return 0;
}


.7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода 
и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы 
отделить соседние введенные строки пробелами.
#include <iostream>
using namespace std;
int main() {
string str1, str2, s;
getline(cin, str1);
getline(cin, str2);
s = str1 + ' ' + str2;
cout << s;
return 0;}


.8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;
выводит первый символ строки. строка пустая тк не была иниацилизированна.
недопустима

.9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.
#include <string>
#include <iostream>
using namespace std;
int main () {
string s;
int line;
getline(cin, s);
line = s.size ();
for (int i = 0; i < line; i++)
if (s[i] != '.' && s[i] != ',' && s[i] != '!' && s[i] != ';' && s[i] != ':' && s[i] != '?' )
cout << s[i];
return 0;}

.10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt
#include <string>
#include <fstream>
using namespace std;
int main () {
ifstream input("input.txt");
string s;
int line;
getline(input, s);
line = s.size ();
ofstream output("output.txt");
for (int i = 0; i < line; i++)
if (s[i] != '.' && s[i] != ',' && s[i] != '!' && s[i] != ';' && s[i] != ':' && s[i] != '?' )
output << s[i];		
return 0;}

Ожидаемый результат.
Файлы с решениями задачи на githab в ветке репозитория группы

Критерии оценки
Каждое упражнение - по 0,5 балла

Материалы: 
1. Липпман, Стенли Б., Лажойе, Жози, Му, Барбара Э.
Язык программирования C++. Вводный курс, 4-е издание.: Пер.с англ. - М.: ООО "И.Д.Вильямс", 2007
	Глава 3. Библиотечные типы данных.
		3.1. Пространства имён и объявления using
		3.2. Библиотечный тип string

2. Александр Смаль, Михаил Кринкин
Программирование на языке C++(материалы предыдущей лекции)
https://stepik.org/course/7