ЛЗ 9. Разработка программ со строками

[1] Упражнения раздела 3.2.1
1) Упражнение 3.2. Что такое стандартный конструктор?

Ответ:
В C++ конструктор может быть вызван без передачи аргументов. 
Если указать конструктор с параметрами, то компилятор не будет создавать конструктор по умолчанию.

2) Упражнение 3.3. Назовите три способа инициализации объекта класса string.

Ответ:	
1.Инициализация во время объявления
string myStr("Это первая строка.");
2.Объявление с присваиванием
string myStr = "Это вторая строка.";
3.Копирование другой строки (копирующий конструктор)
string myStr(othe_Str);
4.string s1; 	
5.string s2(s1);		
6.string s1("Enething");	

3) Упражнение 3.4. Каковы значения переменных s и s2?
string s; 
int main() { 
	string s2;
}

Ответ:
В переменной s и s2 хранятся “\0.


[1] Упражнения раздела 3.2.2
4) Упражнение 3.5. Напишите программу, читающую со стандартного устройства ввода целые строки. 
Измените программу так, чтобы она читала отдельные слова.

Ответ:
#include <iostream>
#include <lokale>
#include <string> 
using namespace std;

int main() {
    setlocale(0, "");
    string str;
    string word;
    cout <<"Read the entire line"<<endl;
    getline(cin, str);
    cout << str << endl;
    cout << "Single word reading"<<endl;
    while (cin >> word)
    cout << word << endl;

	return 0;
}



5) Упражнение 3.6. Объясните, как поступают с символами предваряющих пробелов при чтении данных 
в строковую переменную, когда используется функция getline().

Ответ:
Считывает неформатированные данные из потока в строку. Заканчивает, как только найден символ “\n”


[1] Упражнения раздела 3.2.4
6) Упражнение 3.7. Напишите программу, которая читает две строки и уведомляет, равны ли они, 
а если нет, какая из них больше. Измените программу так, чтобы она указывала, имеют ли строки 
одинаковую длину, и если нет, то какая из них длинней.

Ответ:
-

7) Упражнение 3.8. Напишите программу, способную читать строки со стандартного устройства ввода 
и соединять их в одну большую строку. Отобразите полученную строку. Измените программу так, чтобы 
отделить соседние введенные строки пробелами.

Ответ:
#include <iostream> 
#include <locale>
#include <cstring>
using namespace std;

int main(){
	setlocale(0,"");
    string s1, s2;
    cout<<"Enter the first line \n";
	getline(cin, s1);
	cout<<"Enter the second line \n";
	getline(cin, s2);
	string sum = s1 + s2;
	cout<<"Join lines without space"<<endl<<sum<<endl;
	sum = s1 + " " + s2;
	cout<<"Join lines with space"<<endl<<sum<<endl;
}

8) Упражнение 3.9. Что делает следующая программа? Действительно ли она допустима? Если нет, то почему?
string s;
cout << s[0] << endl;

Ответ:
Эта программа выводит нулевой (первый) символ в строке s. 
Это недопустимо так как строка s создаётся стандартным конструктором (Пустым).

9) Упражнение 3.10. Напишите программу поиска в строке знаков пунктуации. 
Программа должна позволить ввести символьную строку, содержащую знаки пунктуации, 
и вывести ту же строку, но уже без знаков пунктуации.

Ответ:
-

10) (Гусятинер Л.Б.) Изменить программу упражнения 3.10. так, чтобы входные данные поступали из файла input.txt,
а результат записывался в файл output.txt

Ответ:
-
