// """
// В этом простом упражнении вам нужно окружить объявление функции foo стражами включения. В качестве имени 
// стража используйте FOO_HPP и не используйте pragma once.

// Требования к реализации: требуется добавить только стражи включения, ничего другого писать не нужно.
// """
//Выполнил: Богомолов Максим П1-17
//Источник: Stepik Computer Science Center (CS центр)
//Программирование на языке C++
//1.5.12 https://stepik.org/lesson/534/step/12
//25.04.2020
#ifndef FOO_HPP
#define FOO_HPP

void foo();
#endif
